/*
*******************************************************************************
*= = 文件名称：MyInterruptProc.h
*= = 文件描述：关于MyInterruptProc的头文件
*= = 作    者：胡默迪小组
*= = 编写时间：2016-07-09 19:18:00
*******************************************************************************
*/

#ifndef _MyInterruptProc_H__
#define _MyInterruptProc_H__

//*============================================================================ 
//*= = 头文件声明 
//*============================================================================ 

#include <NTDDK.h>
#include "MyMonitorDriver.h"

//*============================================================================ 
//*= = 函数声明 
//*============================================================================

//测试是否可以读取写入键盘端口
ULONG TryKbRead();
ULONG TryKbWrite();

//判断截获字符是否缓冲区中
BOOLEAN InKbBuff(UCHAR CurCh);

//对缓冲区操作 添加或删除字符
VOID PushKbBuff(UCHAR CurCh);
VOID PopKbBuff(UCHAR CurCh);
VOID MyPortFilter();
VOID MyInterruptProc();

#endif		// End of _MyInterruptProc_H__ 

//*============================================================================ 
//*= = 文件结束 
//*============================================================================ 